RinatB2017/STM32/STM32_F1xx/STM32F103C8T6/WS2812B_armor/main.c

#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"

#include "ws2812b.h"

//3.3V 12-255
uint8_t color = 12;
#define NUM_LEDS    30

RGB_t leds_1[NUM_LEDS];
RGB_t leds_2[NUM_LEDS];

void Delay_ms(uint32_t ms)
{
	volatile uint32_t nCount;
	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq (&RCC_Clocks);

	nCount=(RCC_Clocks.HCLK_Frequency/10000)*ms;
	for (; nCount!=0; nCount--);
}

void prepare_red_1(void)
{
	int n = 0;

	RGB_t led;
	led.r = color;
	led.g = 0;
	led.b = 0;
	for(n=0; n<NUM_LEDS; n++)
	{
		leds_1[n] = led;
	}
}

void prepare_red_2(void)
{
	int n = 0;

	RGB_t led;
	led.r = color;
	led.g = 0;
	led.b = 0;
	for(n=0; n<NUM_LEDS; n++)
	{
		leds_2[n] = led;
	}
}

void prepare_green_1(void)
{
	int n = 0;

	RGB_t led;
	led.r = 0;
	led.g = color;
	led.b = 0;
	for(n=0; n<NUM_LEDS; n++)
	{
		leds_1[n] = led;
	}
}

void prepare_green_2(void)
{
	int n = 0;

	RGB_t led;
	led.r = 0;
	led.g = color;
	led.b = 0;
	for(n=0; n<NUM_LEDS; n++)
	{
		leds_2[n] = led;
	}
}

void prepare_blue_1(void)
{
	int n = 0;

	RGB_t led;
	led.r = 0;
	led.g = 0;
	led.b = color;
	for(n=0; n<NUM_LEDS; n++)
	{
		leds_1[n] = led;
	}
}

void prepare_blue_2(void)
{
	int n = 0;

	RGB_t led;
	led.r = 0;
	led.g = 0;
	led.b = color;
	for(n=0; n<NUM_LEDS; n++)
	{
		leds_2[n] = led;
	}
}

int main(void)
{
	ws2812b_Init_1();
	ws2812b_Init_2();
//	int n = 0;

	while (!ws2812b_IsReady_1());
	prepare_red_1();
	ws2812b_SendRGB_1(leds_1, NUM_LEDS);

	while (!ws2812b_IsReady_2());
	prepare_blue_2();
	ws2812b_SendRGB_1(leds_2, NUM_LEDS);

	while (1)
	{
//		while (!ws2812b_IsReady_1()); // wait
//		//---
//		switch(n)
//		{
//		case 0:
//			prepare_red_1();
//			break;
//		case 1:
//			prepare_green_1();
//			break;
//		case 2:
//			prepare_blue_1();
//			break;
//		default:
//			break;
//		}
//		if(n<2)
//			n++;
//		else
//			n=0;
//		//---
//		ws2812b_SendRGB_1(leds_1, NUM_LEDS);
//		Delay_ms(333);
	}
}
